//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    tips: '婴儿出生性别比例在无人为选择下总体而言是1:1，胎儿性别由性染色体决定，YX代表男，XX代表女。本应用依据清宫生男生女表制作，清宫表来历的真实性无从考究，测试准确率为50%，仅供娱乐。',
    array: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    index: 0,
    src: '../../resources/unknown.png',
    motto: 'Hello World',
    qg: { '2000': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '男' }, { '六月': '男' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '男' }, { '十二月': '男' }] , '1999': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '男' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1998': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '男' }, { '六月': '男' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '男' }] ,
    '1997': [{ '一月': '男' }, { '二月': '女' }, { '三月': '女' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1996': [{ '一月': '女' }, { '二月': '男' }, { '三月': '男' }, { '四月': '女' }, { '五月': '男' }, { '六月': '女' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1995': [{ '一月': '男' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '男' }, { '六月': '女' }, { '七月': '男' }, { '八月': '女' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '男' }, { '十二月': '女' }] ,
    '1994': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '男' }, { '五月': '女' }, { '六月': '男' }, { '七月': '男' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1993': [{ '一月': '女' }, { '二月': '男' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '男' }, { '七月': '女' }, { '八月': '男' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '男' }, { '十二月': '男' }] ,
    '1992': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '男' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1991': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '女' }, { '六月': '女' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '男' }] ,
    '1990': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '女' }],
    '1989': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '女' }, { '五月': '男' }, { '六月': '男' }, { '七月': '男' }, { '八月': '男' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1988': [{ '一月': '男' }, { '二月': '女' }, { '三月': '女' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '男' }],
    '1987': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '男' }],
    '1986': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '男' }] ,
    '1985': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '女' }, { '十二月': '男' }],
    '1984': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '男' }] ,
    '1983': [{ '一月': '男' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '女' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '女' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '男' }] ,
    '1982': [{ '一月': '女' }, { '二月': '男' }, { '三月': '男' }, { '四月': '女' }, { '五月': '男' }, { '六月': '女' }, { '七月': '女' }, { '八月': '女' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '男' }, { '十二月': '男' }] ,
     '1981': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '男' }, { '五月': '女' }, { '六月': '男' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '男' }] ,
     '1980': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '男' }, { '六月': '女' }, { '七月': '男' }, { '八月': '女' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '女' }] ,
     '1979': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '男' }, { '五月': '男' }, { '六月': '女' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '女' }] ,
     '1978': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '女' }, { '六月': '男' }, { '七月': '男' }, { '八月': '女' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '女' }] ,
    '1977': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '男' }, { '六月': '女' }, { '七月': '男' }, { '八月': '男' }, { '九月': '女' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '男' }] ,
    '1976': [{ '一月': '女' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '女' }, { '六月': '男' }, { '七月': '女' }, { '八月': '男' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '女' }] ,
    '1975': [{ '一月': '男' }, { '二月': '女' }, { '三月': '男' }, { '四月': '女' }, { '五月': '男' }, { '六月': '女' }, { '七月': '男' }, { '八月': '女' }, { '九月': '男' }, { '十月': '男' }, { '十一月': '男' }, { '十二月': '男' }] ,
    '1974': [{ '一月': '男' }, { '二月': '男' }, { '三月': '女' }, { '四月': '男' }, { '五月': '男' }, { '六月': '男' }, { '七月': '女' }, { '八月': '男' }, { '九月': '女' }, { '十月': '男' }, { '十一月': '女' }, { '十二月': '女' }] ,
    '1973': [{ '一月': '女' }, { '二月': '男' }, { '三月': '男' }, { '四月': '女' }, { '五月': '女' }, { '六月': '女' }, { '七月': '男' }, { '八月': '女' }, { '九月': '男' }, { '十月': '女' }, { '十一月': '男' }, { '十二月': '男' }] },
    userInfo: {},
    hasUserInfo: false,
    canIUse: wx.canIUse('button.open-type.getUserInfo')
  },
  formSubmit: function (e) {
    var age = e.detail.value.age;    
    if (age == '') {
      wx.showToast({
        title: '请输入虚岁年龄',
        icon: 'success',
        duration: 2000
      })
      return;
    } else if (age < 19) {
      wx.showToast({
        title: '不得小于19岁',
        icon: 'success',
        duration: 2000
      })
      return;
    }
    var month = e.detail.value.month;
    var monthDesc = this.data.array[month];
    var date = new Date;
    var year = date.getFullYear();    
    var birthKey = year - age + 1;
    var birthSex = this.data.qg[birthKey][month];
    if(birthSex[monthDesc]){
      if (birthSex[monthDesc] == '男') {
        this.setData({ src: '../../resources/male.png'});
      } else if (birthSex[monthDesc] == '女') {
        this.setData({ src: '../../resources/female.png' });
      } else {
        this.setData({ src: '../../resources/unknown.png' });
      }
    }
  },
  //事件处理函数
  bindViewTap: function() {
    wx.navigateTo({
      url: '../logs/logs'
    })
  },
  onLoad: function () {
    if (app.globalData.userInfo) {
      this.setData({
        userInfo: app.globalData.userInfo,
        hasUserInfo: true
      })
    } else if (this.data.canIUse){
      // 由于 getUserInfo 是网络请求，可能会在 Page.onLoad 之后才返回
      // 所以此处加入 callback 以防止这种情况
      app.userInfoReadyCallback = res => {
        this.setData({
          userInfo: res.userInfo,
          hasUserInfo: true
        })
      }
    } else {
      // 在没有 open-type=getUserInfo 版本的兼容处理
      wx.getUserInfo({
        success: res => {
          app.globalData.userInfo = res.userInfo
          this.setData({
            userInfo: res.userInfo,
            hasUserInfo: true
          })
        }
      })
    }
  },
  getUserInfo: function(e) {
    console.log(e)
    app.globalData.userInfo = e.detail.userInfo
    this.setData({
      userInfo: e.detail.userInfo,
      hasUserInfo: true
    })
  },
  bindPickerChange: function (e) {
    console.log('picker发送选择改变，携带值为', e.detail.value)
    this.setData({
      index: e.detail.value
    })
  }  
})
